
#Область ПрограммныйИнтерфейс

Функция СведенияОВнешнейОбработке() Экспорт
	
	Мета = Метаданные();
	
    ПараметрыРегистрации = ДополнительныеОтчетыИОбработки.СведенияОВнешнейОбработке("2.2.2.1");
    ПараметрыРегистрации.Вид = ДополнительныеОтчетыИОбработкиКлиентСервер.ВидОбработкиДополнительнаяОбработка();
	ПараметрыРегистрации.Наименование = Мета.Синоним;
	ПараметрыРегистрации.Информация =
		"Позволяет Администраторам системы запустить сеанс 1С:Предприятие, не зная пароль пользователя без его изменения.
		|Перед запуском заменяет пароль на заданный, и по таймауту возвращает прежний.";
    ПараметрыРегистрации.Версия = "1.0";
 	ПараметрыРегистрации.БезопасныйРежим = Ложь;
   
    Команда = ПараметрыРегистрации.Команды.Добавить();
    Команда.Представление = Мета.Синоним;
    Команда.Идентификатор = "ОткрытьФорму";
    Команда.Использование = ДополнительныеОтчетыИОбработкиКлиентСервер.ТипКомандыОткрытиеФормы();
    Команда.ПоказыватьОповещение = Ложь;
    
    Возврат ПараметрыРегистрации; 
	
КонецФункции            

#КонецОбласти // ПрограммныйИнтерфейс
