
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	КоличествоСекунд = Параметры.КоличествоСекунд;
	ИнтервалОбновления = 0.1;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ЗапуститьОбратныйОтсчет(КоличествоСекунд); 
	
КонецПроцедуры

#КонецОбласти // ОбработчикиСобытийФормы

#Область ОбработчикиОповещений

&НаКлиенте
Процедура ТикТак()

	Если ТекущаяДата() >= ВремяОкончанияОтсчета Тогда
		Закрыть();
	Иначе
		ОбновитьТаймер();
		ПодключитьОбработчикОжидания("ТикТак", ИнтервалОбновления, Истина);
	КонецЕсли;

КонецПроцедуры // Тик()

&НаКлиенте
Процедура ОбновитьТаймер()

	ОсталосьМиллисекунд = ОсталосьМиллисекунд();
	ОбновитьЗаголовок();

КонецПроцедуры

&НаКлиенте
Процедура ОбновитьЗаголовок()
	
	ОсталосьСекундЗаголовок = ОсталосьСекунд;
	ОсталосьСекунд = ОсталосьСекунд();       
	Если ОсталосьСекундЗаголовок <> ОсталосьСекунд Тогда	// Чтобы пореже обновлять заголовок.
		Заголовок = СтрШаблон("Осталось %1 сек.", Формат(ОсталосьСекунд, "ЧН=0"));
	КонецЕсли;

КонецПроцедуры // ОбновитьТаймер()
	
#КонецОбласти // ОбработчикиОповещений

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ЗапуститьОбратныйОтсчет(КоличествоСекунд)
	
	ВремяОкончанияОтсчетаМсек = ТекущаяУниверсальнаяДатаВМиллисекундах() + КоличествоСекунд * 1000;
	ВремяОкончанияОтсчета = ТекущаяДата() + КоличествоСекунд;	
	ОбновитьЗаголовок();
	Элементы.ОсталосьМиллисекунд.МаксимальноеЗначение = ОсталосьМиллисекунд();
	ПодключитьОбработчикОжидания("ТикТак", ИнтервалОбновления, Истина);

КонецПроцедуры

&НаКлиенте
Функция ОсталосьСекунд()
	
	Возврат ВремяОкончанияОтсчета - ТекущаяДата();

КонецФункции // ЗапуститьОбратныйОтсчет()   

&НаКлиенте
Функция ОсталосьМиллисекунд()

	Возврат ВремяОкончанияОтсчетаМсек - ТекущаяУниверсальнаяДатаВМиллисекундах();	

КонецФункции // ()


#КонецОбласти // СлужебныеПроцедурыИФункции

